# IFC_DMIsPSetFldEnbl

## Description
Checks if specified Field for IfcEntry's PSet is Enabled.

```pascal
FUNCTION IFC_DMIsPSetFldEnbl(
				strObjectName : STRING;
				strEntryName  : STRING;
				strPSetName   : STRING;
				strFieldName  : STRING): BOOLEAN;
```

```python
def vs.IFC_DMIsPSetFldEnbl(strObjectName, strEntryName, strPSetName, strFieldName):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|strObjectName|STRING|   |
|strEntryName|STRING|   |
|strPSetName|STRING|   |
|strFieldName|STRING|   |

## Version
Availability: from Vectorworks 2021

## Category
* IFC